{
"clap: Human action for clap refers to the act of striking one's hands together to produce a sharp, loud sound.": 0, 
"circle: A human action for \"circle\" could mean drawing a circular shape or moving in a circular pattern.": 1, 
"jumping jack: A jumping jack is a physical exercise in which one jumps from a standing position with legs together and arms at the sides to a position with the legs apart and the arms above the head.": 2, 
"squat down: The human action \"squat down\" means to bend the knees and lower the body close to the ground.": 3, 
"jump squat: Jump squat is a human action involving a lower body exercise that combines a squat with a jump.": 4, 
"push-up: Human action for push-up refers to the body movement of raising and lowering oneself by arm strength.": 5, 
"sit down: Human action for sit down refers to a person lowering their body to rest in a seated position.": 6, 
"salute: A salute is a gesture of respect or acknowledgement, often used in military or ceremonial contexts.": 7, 
"bend forward: \"Bend forward\" means to lean or incline the upper part of the body towards the front or ground.": 8, 
"hurdle start: Human action for hurdle start refers to the physical movements a person undertakes to begin a hurdle race.": 9, 
"long jump: Human action for long jump involves running, leaping, and landing to achieve maximum horizontal distance.": 10, 
"nod head: Nodding the head is a human action typically used to express agreement, affirmation or understanding.": 11, 
"walking: Human action for walking refers to the conscious, voluntary movement of legs for locomotion.": 12, 
"running: Running is a human action involving swift movement on foot where both feet leave the ground simultaneously.": 13, 
"shake head: Shake head as a human action means to move one's head from side to side, typically indicating denial or disapproval.": 14, 
"circle head: Human action for circle head refers to the movements or behaviors performed by a character with a rounded face.": 15, 
"circle arm: Human action for circle arm refers to the movement where a person swings their arm in a circular motion.": 16, 
"raise the arm: Human action to raise the arm refers to the deliberate, volitional movement of the upper limb upwards.": 17, 
"side kick: A human action side kick involves someone performing a swift, sideways kicking movement, often in martial arts.": 18, 
"forward kick: Human action for forward kick involves projecting force from the leg to strike or propel something forward.": 19, 
"high leg lift: High leg lift in human action denotes the movement of raising one's leg up to waist level or higher.": 20, 
"waving hand: Waving hand is a human action used as a gesture for greeting, attention-seeking or saying goodbye.": 21, 
"punch straight forward: Human action for punch straight forward refers to the physical movement of thrusting one's fist directly ahead.": 22, 
"catch a ball: Human action to catch a ball refers to the conscious and coordinated physical effort to intercept and secure a thrown ball.": 1000, 
"throw a ball: Human action for throwing a ball refers to the physical movement people perform to propel a ball.": 1001, 
"catch and throw a ball: Human action for catching and throwing a ball involves coordination of motor skills, timing, and visual perception.": 1002, 
"walk with a ball: Human action for \"walk with a ball\" refers to a person moving while carrying or controlling a ball.": 1003, 
"circle the ball around the main body: The person is moving the ball in a circular motion around their body.": 1004, 
"circle the ball around the leg: Human action for circling the ball around the leg refers to maneuvering a ball around one's limb.": 1005, 
"open and close umbrella: Human action for open and close umbrella refers to the physical activity of expanding or folding an umbrella.": 1006, 
"open the computer: The human action to open the computer refers to the act of power-on or initiating the computer system.": 1007, 
"close the computer: Human action to close the computer refers to a person manually shutting down or turning off the PC.": 1008, 
"use the phone: Human action refers to the steps taken by a person, such as dialling numbers on a phone.": 1009, 
"put on glasses: The human action of putting on glasses involves lifting eyewear to the face and positioning them over the eyes.": 1010, 
"put off glasses: The human action of putting off glasses refers to the act of removing eyewear from one's face.": 1011, 
"tie shoelaces: Human action for tying shoelaces involves intricately manipulating and knotting laces to secure shoes onto feet.": 1012, 
"take a photo: Human action for taking a photo refers to someone using a camera or smartphone to capture images.": 1013, 
"lift the box: Human action for lifting the box refers to a person using their strength and effort to elevate a container.": 1014, 
"put down the box: The term refers to the deliberate movement carried out by a person to set a box on a surface.": 1015, 
"drink water: Human action for drinking water refers to the voluntary activity of ingesting liquid H2O for hydration.": 1016, 
"twist the bottle cap: Human action for twisting the bottle cap involves applying force to rotate the cap for removal or tightening.": 1017, 
"walk with an opened unbrella: A person strolling with an opened umbrella usually indicates protection from ongoing rain or harsh sun.": 1018, 
"walk with a box: Human action for walk with a box involves a person physically moving while carrying a container.": 1019, 
"run with a box: A human action for run with a box means the physical activity of a person jogging or sprinting while carrying a box.": 1020, 
"falling down: Falling down refers to the involuntary action of losing balance and suddenly collapsing to the ground.": 2000, 
"vomit: Human action for vomit refers to the act of forcefully expelling stomach contents through the mouth.": 2001, 
"staggering: Staggering in human action refers to an unsteady, wobbly movement often resulting from weakness or exhaustion.": 2002, 
"walk with stomach pain: A human action of walking with stomach pain refers to someone moving while experiencing abdominal discomfort.": 2003, 
"walk with headache: A human action for walk with headache refers to the act of moving on foot while experiencing head pain.": 2004, 
" walk with back pain: The human action \"walk with back pain\" refers to an individual moving around while experiencing discomfort in their spine.": 2005, 
"leg injury walking: Human action for leg injury walking refers to the deliberate movements made by an individual to accommodate a leg injury while walking.": 2006, 
"hug: A human action for hug means an embrace with arms typically to express affection or comfort.": 3000, 
"fight: Human action for fight refers to the physical or mental efforts made by humans to confront or resist something.": 3001, 
"wave hand to each other: Waving hand to each other is a non-verbal greeting or departure gesture commonly used among humans.": 3002, 
"handshake: A handshake is a human action symbolizing agreement, friendship, respect, or conclusion of a deal.": 3003, 
"shoulder tapping: Shoulder tapping is a human action signifying attention-seeking, alerting someone, or initiating communication.": 3004, 
"clap hand: Clapping hands involves striking both hands together repeatedly to create noise, often as a form of applause.": 3005, 
"handing box: Human action for handing box refers to the physical motion of a person giving or passing a box to someone else.": 3006
}